dxon/asiCanConverter/Soft/BootLoader - копия/stm32f4xx - копия.h
#define DSI_LCOLCR_LPE                 ((uint32_t)0x00000100)               /*!< Loosly Packet Enable */

/*******************  Bit definition for DSI_LPCR register  ***************/
#define DSI_LPCR_DEP                   ((uint32_t)0x00000001)               /*!< Data Enable Polarity */
#define DSI_LPCR_VSP                   ((uint32_t)0x00000002)               /*!< VSYNC Polarity */
#define DSI_LPCR_HSP                   ((uint32_t)0x00000004)               /*!< HSYNC Polarity */

/*******************  Bit definition for DSI_LPMCR register  **************/
#define DSI_LPMCR_VLPSIZE              ((uint32_t)0x000000FF)               /*!< VACT Largest Packet Size */
#define DSI_LPMCR_VLPSIZE0             ((uint32_t)0x00000001)
#define DSI_LPMCR_VLPSIZE1             ((uint32_t)0x00000002)
#define DSI_LPMCR_VLPSIZE2             ((uint32_t)0x00000004)
#define DSI_LPMCR_VLPSIZE3             ((uint32_t)0x00000008)
#define DSI_LPMCR_VLPSIZE4             ((uint32_t)0x00000010)
#define DSI_LPMCR_VLPSIZE5             ((uint32_t)0x00000020)
#define DSI_LPMCR_VLPSIZE6             ((uint32_t)0x00000040)
#define DSI_LPMCR_VLPSIZE7             ((uint32_t)0x00000080)

#define DSI_LPMCR_LPSIZE               ((uint32_t)0x00FF0000)               /*!< Largest Packet Size */
#define DSI_LPMCR_LPSIZE0              ((uint32_t)0x00010000)
#define DSI_LPMCR_LPSIZE1              ((uint32_t)0x00020000)
#define DSI_LPMCR_LPSIZE2              ((uint32_t)0x00040000)
#define DSI_LPMCR_LPSIZE3              ((uint32_t)0x00080000)
#define DSI_LPMCR_LPSIZE4              ((uint32_t)0x00100000)
#define DSI_LPMCR_LPSIZE5              ((uint32_t)0x00200000)
#define DSI_LPMCR_LPSIZE6              ((uint32_t)0x00400000)
#define DSI_LPMCR_LPSIZE7              ((uint32_t)0x00800000)

/*******************  Bit definition for DSI_PCR register  ****************/
#define DSI_PCR_ETTXE                  ((uint32_t)0x00000001)               /*!< EoTp Transmission Enable */
#define DSI_PCR_ETRXE                  ((uint32_t)0x00000002)               /*!< EoTp Reception Enable */
#define DSI_PCR_BTAE                   ((uint32_t)0x00000004)               /*!< Bus Turn Around Enable */
#define DSI_PCR_ECCRXE                 ((uint32_t)0x00000008)               /*!< ECC Reception Enable */
#define DSI_PCR_CRCRXE                 ((uint32_t)0x00000010)               /*!< CRC Reception Enable */

/*******************  Bit definition for DSI_GVCIDR register  *************/
#define DSI_GVCIDR_VCID                ((uint32_t)0x00000003)               /*!< Virtual Channel ID */
#define DSI_GVCIDR_VCID0               ((uint32_t)0x00000001)
#define DSI_GVCIDR_VCID1               ((uint32_t)0x00000002)

/*******************  Bit definition for DSI_MCR register  ****************/
#define DSI_MCR_CMDM                   ((uint32_t)0x00000001)               /*!< Command Mode */

/*******************  Bit definition for DSI_VMCR register  ***************/
#define DSI_VMCR_VMT                   ((uint32_t)0x00000003)               /*!< Video Mode Type */
#define DSI_VMCR_VMT0                  ((uint32_t)0x00000001)
#define DSI_VMCR_VMT1                  ((uint32_t)0x00000002)

#define DSI_VMCR_LPVSAE                ((uint32_t)0x00000100)               /*!< Low-Power Vertical Sync Active Enable */
#define DSI_VMCR_LPVBPE                ((uint32_t)0x00000200)               /*!< Low-power Vertical Back-Porch Enable */
#define DSI_VMCR_LPVFPE                ((uint32_t)0x00000400)               /*!< Low-power Vertical Front-porch Enable */
#define DSI_VMCR_LPVAE                 ((uint32_t)0x00000800)               /*!< Low-Power Vertical Active Enable */
#define DSI_VMCR_LPHBPE                ((uint32_t)0x00001000)               /*!< Low-Power Horizontal Back-Porch Enable */
#define DSI_VMCR_LPHFPE                ((uint32_t)0x00002000)               /*!< Low-Power Horizontal Front-Porch Enable */
#define DSI_VMCR_FBTAAE                ((uint32_t)0x00004000)               /*!< Frame Bus-Turn-Around Acknowledge Enable */
#define DSI_VMCR_LPCE                  ((uint32_t)0x00008000)               /*!< Low-Power Command Enable */
#define DSI_VMCR_PGE                   ((uint32_t)0x00010000)               /*!< Pattern Generator Enable */
#define DSI_VMCR_PGM                   ((uint32_t)0x00100000)               /*!< Pattern Generator Mode */
#define DSI_VMCR_PGO                   ((uint32_t)0x01000000)               /*!< Pattern Generator Orientation */

/*******************  Bit definition for DSI_VPCR register  ***************/
#define DSI_VPCR_VPSIZE                ((uint32_t)0x00003FFF)               /*!< Video Packet Size */
#define DSI_VPCR_VPSIZE0               ((uint32_t)0x00000001)
#define DSI_VPCR_VPSIZE1               ((uint32_t)0x00000002)
#define DSI_VPCR_VPSIZE2               ((uint32_t)0x00000004)
#define DSI_VPCR_VPSIZE3               ((uint32_t)0x00000008)
#define DSI_VPCR_VPSIZE4               ((uint32_t)0x00000010)
#define DSI_VPCR_VPSIZE5               ((uint32_t)0x00000020)
#define DSI_VPCR_VPSIZE6               ((uint32_t)0x00000040)
#define DSI_VPCR_VPSIZE7               ((uint32_t)0x00000080)
#define DSI_VPCR_VPSIZE8               ((uint32_t)0x00000100)
#define DSI_VPCR_VPSIZE9               ((uint32_t)0x00000200)
#define DSI_VPCR_VPSIZE10              ((uint32_t)0x00000400)
#define DSI_VPCR_VPSIZE11              ((uint32_t)0x00000800)
#define DSI_VPCR_VPSIZE12              ((uint32_t)0x00001000)
#define DSI_VPCR_VPSIZE13              ((uint32_t)0x00002000)

/*******************  Bit definition for DSI_VCCR register  ***************/
#define DSI_VCCR_NUMC                  ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSI_VCCR_NUMC0                 ((uint32_t)0x00000001)
#define DSI_VCCR_NUMC1                 ((uint32_t)0x00000002)
#define DSI_VCCR_NUMC2                 ((uint32_t)0x00000004)
#define DSI_VCCR_NUMC3                 ((uint32_t)0x00000008)
#define DSI_VCCR_NUMC4                 ((uint32_t)0x00000010)
#define DSI_VCCR_NUMC5                 ((uint32_t)0x00000020)
#define DSI_VCCR_NUMC6                 ((uint32_t)0x00000040)
#define DSI_VCCR_NUMC7                 ((uint32_t)0x00000080)
#define DSI_VCCR_NUMC8                 ((uint32_t)0x00000100)
#define DSI_VCCR_NUMC9                 ((uint32_t)0x00000200)
#define DSI_VCCR_NUMC10                ((uint32_t)0x00000400)
#define DSI_VCCR_NUMC11                ((uint32_t)0x00000800)
#define DSI_VCCR_NUMC12                ((uint32_t)0x00001000)

/*******************  Bit definition for DSI_VNPCR register  **************/
#define DSI_VNPCR_NPSIZE               ((uint32_t)0x00001FFF)               /*!< Null Packet Size */
#define DSI_VNPCR_NPSIZE0              ((uint32_t)0x00000001)
#define DSI_VNPCR_NPSIZE1              ((uint32_t)0x00000002)
#define DSI_VNPCR_NPSIZE2              ((uint32_t)0x00000004)
#define DSI_VNPCR_NPSIZE3              ((uint32_t)0x00000008)
#define DSI_VNPCR_NPSIZE4              ((uint32_t)0x00000010)
#define DSI_VNPCR_NPSIZE5              ((uint32_t)0x00000020)
#define DSI_VNPCR_NPSIZE6              ((uint32_t)0x00000040)
#define DSI_VNPCR_NPSIZE7              ((uint32_t)0x00000080)
#define DSI_VNPCR_NPSIZE8              ((uint32_t)0x00000100)
#define DSI_VNPCR_NPSIZE9              ((uint32_t)0x00000200)
#define DSI_VNPCR_NPSIZE10             ((uint32_t)0x00000400)
#define DSI_VNPCR_NPSIZE11             ((uint32_t)0x00000800)
#define DSI_VNPCR_NPSIZE12             ((uint32_t)0x00001000)

/*******************  Bit definition for DSI_VHSACR register  *************/
#define DSI_VHSACR_HSA                 ((uint32_t)0x00000FFF)               /*!< Horizontal Synchronism Active duration */
#define DSI_VHSACR_HSA0                ((uint32_t)0x00000001)
#define DSI_VHSACR_HSA1                ((uint32_t)0x00000002)
#define DSI_VHSACR_HSA2                ((uint32_t)0x00000004)
#define DSI_VHSACR_HSA3                ((uint32_t)0x00000008)
#define DSI_VHSACR_HSA4                ((uint32_t)0x00000010)
#define DSI_VHSACR_HSA5                ((uint32_t)0x00000020)
#define DSI_VHSACR_HSA6                ((uint32_t)0x00000040)
#define DSI_VHSACR_HSA7                ((uint32_t)0x00000080)
#define DSI_VHSACR_HSA8                ((uint32_t)0x00000100)
#define DSI_VHSACR_HSA9                ((uint32_t)0x00000200)
#define DSI_VHSACR_HSA10               ((uint32_t)0x00000400)
#define DSI_VHSACR_HSA11               ((uint32_t)0x00000800)

/*******************  Bit definition for DSI_VHBPCR register  *************/
#define DSI_VHBPCR_HBP                 ((uint32_t)0x00000FFF)               /*!< Horizontal Back-Porch duration */
#define DSI_VHBPCR_HBP0                ((uint32_t)0x00000001)
#define DSI_VHBPCR_HBP1                ((uint32_t)0x00000002)
#define DSI_VHBPCR_HBP2                ((uint32_t)0x00000004)
#define DSI_VHBPCR_HBP3                ((uint32_t)0x00000008)
#define DSI_VHBPCR_HBP4                ((uint32_t)0x00000010)
#define DSI_VHBPCR_HBP5                ((uint32_t)0x00000020)
#define DSI_VHBPCR_HBP6                ((uint32_t)0x00000040)
#define DSI_VHBPCR_HBP7                ((uint32_t)0x00000080)
#define DSI_VHBPCR_HBP8                ((uint32_t)0x00000100)
#define DSI_VHBPCR_HBP9                ((uint32_t)0x00000200)
#define DSI_VHBPCR_HBP10               ((uint32_t)0x00000400)
#define DSI_VHBPCR_HBP11               ((uint32_t)0x00000800)

