dxon/asiCanConverter/Soft/BootLoader - копия/stm32f4xx - копия.h
/*******************  Bit definition for DSI_VLCR register  ***************/
#define DSI_VLCR_HLINE                 ((uint32_t)0x00007FFF)               /*!< Horizontal Line duration */
#define DSI_VLCR_HLINE0                ((uint32_t)0x00000001)
#define DSI_VLCR_HLINE1                ((uint32_t)0x00000002)
#define DSI_VLCR_HLINE2                ((uint32_t)0x00000004)
#define DSI_VLCR_HLINE3                ((uint32_t)0x00000008)
#define DSI_VLCR_HLINE4                ((uint32_t)0x00000010)
#define DSI_VLCR_HLINE5                ((uint32_t)0x00000020)
#define DSI_VLCR_HLINE6                ((uint32_t)0x00000040)
#define DSI_VLCR_HLINE7                ((uint32_t)0x00000080)
#define DSI_VLCR_HLINE8                ((uint32_t)0x00000100)
#define DSI_VLCR_HLINE9                ((uint32_t)0x00000200)
#define DSI_VLCR_HLINE10               ((uint32_t)0x00000400)
#define DSI_VLCR_HLINE11               ((uint32_t)0x00000800)
#define DSI_VLCR_HLINE12               ((uint32_t)0x00001000)
#define DSI_VLCR_HLINE13               ((uint32_t)0x00002000)
#define DSI_VLCR_HLINE14               ((uint32_t)0x00004000)

/*******************  Bit definition for DSI_VVSACR register  *************/
#define DSI_VVSACR_VSA                 ((uint32_t)0x000003FF)               /*!< Vertical Synchronism Active duration */
#define DSI_VVSACR_VSA0                ((uint32_t)0x00000001)
#define DSI_VVSACR_VSA1                ((uint32_t)0x00000002)
#define DSI_VVSACR_VSA2                ((uint32_t)0x00000004)
#define DSI_VVSACR_VSA3                ((uint32_t)0x00000008)
#define DSI_VVSACR_VSA4                ((uint32_t)0x00000010)
#define DSI_VVSACR_VSA5                ((uint32_t)0x00000020)
#define DSI_VVSACR_VSA6                ((uint32_t)0x00000040)
#define DSI_VVSACR_VSA7                ((uint32_t)0x00000080)
#define DSI_VVSACR_VSA8                ((uint32_t)0x00000100)
#define DSI_VVSACR_VSA9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVBPCR register  *************/
#define DSI_VVBPCR_VBP                 ((uint32_t)0x000003FF)               /*!< Vertical Back-Porch duration */
#define DSI_VVBPCR_VBP0                ((uint32_t)0x00000001)
#define DSI_VVBPCR_VBP1                ((uint32_t)0x00000002)
#define DSI_VVBPCR_VBP2                ((uint32_t)0x00000004)
#define DSI_VVBPCR_VBP3                ((uint32_t)0x00000008)
#define DSI_VVBPCR_VBP4                ((uint32_t)0x00000010)
#define DSI_VVBPCR_VBP5                ((uint32_t)0x00000020)
#define DSI_VVBPCR_VBP6                ((uint32_t)0x00000040)
#define DSI_VVBPCR_VBP7                ((uint32_t)0x00000080)
#define DSI_VVBPCR_VBP8                ((uint32_t)0x00000100)
#define DSI_VVBPCR_VBP9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVFPCR register  *************/
#define DSI_VVFPCR_VFP                 ((uint32_t)0x000003FF)               /*!< Vertical Front-Porch duration */
#define DSI_VVFPCR_VFP0                ((uint32_t)0x00000001)
#define DSI_VVFPCR_VFP1                ((uint32_t)0x00000002)
#define DSI_VVFPCR_VFP2                ((uint32_t)0x00000004)
#define DSI_VVFPCR_VFP3                ((uint32_t)0x00000008)
#define DSI_VVFPCR_VFP4                ((uint32_t)0x00000010)
#define DSI_VVFPCR_VFP5                ((uint32_t)0x00000020)
#define DSI_VVFPCR_VFP6                ((uint32_t)0x00000040)
#define DSI_VVFPCR_VFP7                ((uint32_t)0x00000080)
#define DSI_VVFPCR_VFP8                ((uint32_t)0x00000100)
#define DSI_VVFPCR_VFP9                ((uint32_t)0x00000200)

/*******************  Bit definition for DSI_VVACR register  **************/
#define DSI_VVACR_VA                   ((uint32_t)0x00003FFF)               /*!< Vertical Active duration */
#define DSI_VVACR_VA0                  ((uint32_t)0x00000001)
#define DSI_VVACR_VA1                  ((uint32_t)0x00000002)
#define DSI_VVACR_VA2                  ((uint32_t)0x00000004)
#define DSI_VVACR_VA3                  ((uint32_t)0x00000008)
#define DSI_VVACR_VA4                  ((uint32_t)0x00000010)
#define DSI_VVACR_VA5                  ((uint32_t)0x00000020)
#define DSI_VVACR_VA6                  ((uint32_t)0x00000040)
#define DSI_VVACR_VA7                  ((uint32_t)0x00000080)
#define DSI_VVACR_VA8                  ((uint32_t)0x00000100)
#define DSI_VVACR_VA9                  ((uint32_t)0x00000200)
#define DSI_VVACR_VA10                 ((uint32_t)0x00000400)
#define DSI_VVACR_VA11                 ((uint32_t)0x00000800)
#define DSI_VVACR_VA12                 ((uint32_t)0x00001000)
#define DSI_VVACR_VA13                 ((uint32_t)0x00002000)

/*******************  Bit definition for DSI_LCCR register  ***************/
#define DSI_LCCR_CMDSIZE               ((uint32_t)0x0000FFFF)               /*!< Command Size */
#define DSI_LCCR_CMDSIZE0              ((uint32_t)0x00000001)
#define DSI_LCCR_CMDSIZE1              ((uint32_t)0x00000002)
#define DSI_LCCR_CMDSIZE2              ((uint32_t)0x00000004)
#define DSI_LCCR_CMDSIZE3              ((uint32_t)0x00000008)
#define DSI_LCCR_CMDSIZE4              ((uint32_t)0x00000010)
#define DSI_LCCR_CMDSIZE5              ((uint32_t)0x00000020)
#define DSI_LCCR_CMDSIZE6              ((uint32_t)0x00000040)
#define DSI_LCCR_CMDSIZE7              ((uint32_t)0x00000080)
#define DSI_LCCR_CMDSIZE8              ((uint32_t)0x00000100)
#define DSI_LCCR_CMDSIZE9              ((uint32_t)0x00000200)
#define DSI_LCCR_CMDSIZE10             ((uint32_t)0x00000400)
#define DSI_LCCR_CMDSIZE11             ((uint32_t)0x00000800)
#define DSI_LCCR_CMDSIZE12             ((uint32_t)0x00001000)
#define DSI_LCCR_CMDSIZE13             ((uint32_t)0x00002000)
#define DSI_LCCR_CMDSIZE14             ((uint32_t)0x00004000)
#define DSI_LCCR_CMDSIZE15             ((uint32_t)0x00008000)

/*******************  Bit definition for DSI_CMCR register  ***************/
#define DSI_CMCR_TEARE                 ((uint32_t)0x00000001)               /*!< Tearing Effect Acknowledge Request Enable */
#define DSI_CMCR_ARE                   ((uint32_t)0x00000002)               /*!< Acknowledge Request Enable */
#define DSI_CMCR_GSW0TX                ((uint32_t)0x00000100)               /*!< Generic Short Write Zero parameters Transmission */
#define DSI_CMCR_GSW1TX                ((uint32_t)0x00000200)               /*!< Generic Short Write One parameters Transmission */
#define DSI_CMCR_GSW2TX                ((uint32_t)0x00000400)               /*!< Generic Short Write Two parameters Transmission */
#define DSI_CMCR_GSR0TX                ((uint32_t)0x00000800)               /*!< Generic Short Read Zero parameters Transmission */
#define DSI_CMCR_GSR1TX                ((uint32_t)0x00001000)               /*!< Generic Short Read One parameters Transmission */
#define DSI_CMCR_GSR2TX                ((uint32_t)0x00002000)               /*!< Generic Short Read Two parameters Transmission */
#define DSI_CMCR_GLWTX                 ((uint32_t)0x00004000)               /*!< Generic Long Write Transmission */
#define DSI_CMCR_DSW0TX                ((uint32_t)0x00010000)               /*!< DCS Short Write Zero parameter Transmission */
#define DSI_CMCR_DSW1TX                ((uint32_t)0x00020000)               /*!< DCS Short Read One parameter Transmission */
#define DSI_CMCR_DSR0TX                ((uint32_t)0x00040000)               /*!< DCS Short Read Zero parameter Transmission */
#define DSI_CMCR_DLWTX                 ((uint32_t)0x00080000)               /*!< DCS Long Write Transmission */
#define DSI_CMCR_MRDPS                 ((uint32_t)0x01000000)               /*!< Maximum Read Packet Size */

/*******************  Bit definition for DSI_GHCR register  ***************/
#define DSI_GHCR_DT                    ((uint32_t)0x0000003F)               /*!< Type */
#define DSI_GHCR_DT0                   ((uint32_t)0x00000001)
#define DSI_GHCR_DT1                   ((uint32_t)0x00000002)
#define DSI_GHCR_DT2                   ((uint32_t)0x00000004)
#define DSI_GHCR_DT3                   ((uint32_t)0x00000008)
#define DSI_GHCR_DT4                   ((uint32_t)0x00000010)
#define DSI_GHCR_DT5                   ((uint32_t)0x00000020)

