dxon/asiCanConverter/Soft/BootLoader - копия/stm32f4xx - копия.h
#define DSI_GHCR_VCID                  ((uint32_t)0x000000C0)               /*!< Channel */
#define DSI_GHCR_VCID0                 ((uint32_t)0x00000040)
#define DSI_GHCR_VCID1                 ((uint32_t)0x00000080)

#define DSI_GHCR_WCLSB                 ((uint32_t)0x0000FF00)               /*!< WordCount LSB */
#define DSI_GHCR_WCLSB0                ((uint32_t)0x00000100)
#define DSI_GHCR_WCLSB1                ((uint32_t)0x00000200)
#define DSI_GHCR_WCLSB2                ((uint32_t)0x00000400)
#define DSI_GHCR_WCLSB3                ((uint32_t)0x00000800)
#define DSI_GHCR_WCLSB4                ((uint32_t)0x00001000)
#define DSI_GHCR_WCLSB5                ((uint32_t)0x00002000)
#define DSI_GHCR_WCLSB6                ((uint32_t)0x00004000)
#define DSI_GHCR_WCLSB7                ((uint32_t)0x00008000)

#define DSI_GHCR_WCMSB                 ((uint32_t)0x00FF0000)               /*!< WordCount MSB */
#define DSI_GHCR_WCMSB0                ((uint32_t)0x00010000)
#define DSI_GHCR_WCMSB1                ((uint32_t)0x00020000)
#define DSI_GHCR_WCMSB2                ((uint32_t)0x00040000)
#define DSI_GHCR_WCMSB3                ((uint32_t)0x00080000)
#define DSI_GHCR_WCMSB4                ((uint32_t)0x00100000)
#define DSI_GHCR_WCMSB5                ((uint32_t)0x00200000)
#define DSI_GHCR_WCMSB6                ((uint32_t)0x00400000)
#define DSI_GHCR_WCMSB7                ((uint32_t)0x00800000)

/*******************  Bit definition for DSI_GPDR register  ***************/
#define DSI_GPDR_DATA1                 ((uint32_t)0x000000FF)               /*!< Payload Byte 1 */
#define DSI_GPDR_DATA1_0               ((uint32_t)0x00000001)
#define DSI_GPDR_DATA1_1               ((uint32_t)0x00000002)
#define DSI_GPDR_DATA1_2               ((uint32_t)0x00000004)
#define DSI_GPDR_DATA1_3               ((uint32_t)0x00000008)
#define DSI_GPDR_DATA1_4               ((uint32_t)0x00000010)
#define DSI_GPDR_DATA1_5               ((uint32_t)0x00000020)
#define DSI_GPDR_DATA1_6               ((uint32_t)0x00000040)
#define DSI_GPDR_DATA1_7               ((uint32_t)0x00000080)

#define DSI_GPDR_DATA2                 ((uint32_t)0x0000FF00)               /*!< Payload Byte 2 */
#define DSI_GPDR_DATA2_0               ((uint32_t)0x00000100)
#define DSI_GPDR_DATA2_1               ((uint32_t)0x00000200)
#define DSI_GPDR_DATA2_2               ((uint32_t)0x00000400)
#define DSI_GPDR_DATA2_3               ((uint32_t)0x00000800)
#define DSI_GPDR_DATA2_4               ((uint32_t)0x00001000)
#define DSI_GPDR_DATA2_5               ((uint32_t)0x00002000)
#define DSI_GPDR_DATA2_6               ((uint32_t)0x00004000)
#define DSI_GPDR_DATA2_7               ((uint32_t)0x00008000)

#define DSI_GPDR_DATA3                 ((uint32_t)0x00FF0000)               /*!< Payload Byte 3 */
#define DSI_GPDR_DATA3_0               ((uint32_t)0x00010000)
#define DSI_GPDR_DATA3_1               ((uint32_t)0x00020000)
#define DSI_GPDR_DATA3_2               ((uint32_t)0x00040000)
#define DSI_GPDR_DATA3_3               ((uint32_t)0x00080000)
#define DSI_GPDR_DATA3_4               ((uint32_t)0x00100000)
#define DSI_GPDR_DATA3_5               ((uint32_t)0x00200000)
#define DSI_GPDR_DATA3_6               ((uint32_t)0x00400000)
#define DSI_GPDR_DATA3_7               ((uint32_t)0x00800000)

#define DSI_GPDR_DATA4                 ((uint32_t)0xFF000000)               /*!< Payload Byte 4 */
#define DSI_GPDR_DATA4_0               ((uint32_t)0x01000000)
#define DSI_GPDR_DATA4_1               ((uint32_t)0x02000000)
#define DSI_GPDR_DATA4_2               ((uint32_t)0x04000000)
#define DSI_GPDR_DATA4_3               ((uint32_t)0x08000000)
#define DSI_GPDR_DATA4_4               ((uint32_t)0x10000000)
#define DSI_GPDR_DATA4_5               ((uint32_t)0x20000000)
#define DSI_GPDR_DATA4_6               ((uint32_t)0x40000000)
#define DSI_GPDR_DATA4_7               ((uint32_t)0x80000000)

/*******************  Bit definition for DSI_GPSR register  ***************/
#define DSI_GPSR_CMDFE                 ((uint32_t)0x00000001)               /*!< Command FIFO Empty */
#define DSI_GPSR_CMDFF                 ((uint32_t)0x00000002)               /*!< Command FIFO Full */
#define DSI_GPSR_PWRFE                 ((uint32_t)0x00000004)               /*!< Payload Write FIFO Empty */
#define DSI_GPSR_PWRFF                 ((uint32_t)0x00000008)               /*!< Payload Write FIFO Full */
#define DSI_GPSR_PRDFE                 ((uint32_t)0x00000010)               /*!< Payload Read FIFO Empty */
#define DSI_GPSR_PRDFF                 ((uint32_t)0x00000020)               /*!< Payload Read FIFO Full */
#define DSI_GPSR_RCB                   ((uint32_t)0x00000040)               /*!< Read Command Busy */

/*******************  Bit definition for DSI_TCCR0 register  **************/
#define DSI_TCCR0_LPRX_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-power Reception Timeout Counter */
#define DSI_TCCR0_LPRX_TOCNT0          ((uint32_t)0x00000001)
#define DSI_TCCR0_LPRX_TOCNT1          ((uint32_t)0x00000002)
#define DSI_TCCR0_LPRX_TOCNT2          ((uint32_t)0x00000004)
#define DSI_TCCR0_LPRX_TOCNT3          ((uint32_t)0x00000008)
#define DSI_TCCR0_LPRX_TOCNT4          ((uint32_t)0x00000010)
#define DSI_TCCR0_LPRX_TOCNT5          ((uint32_t)0x00000020)
#define DSI_TCCR0_LPRX_TOCNT6          ((uint32_t)0x00000040)
#define DSI_TCCR0_LPRX_TOCNT7          ((uint32_t)0x00000080)
#define DSI_TCCR0_LPRX_TOCNT8          ((uint32_t)0x00000100)
#define DSI_TCCR0_LPRX_TOCNT9          ((uint32_t)0x00000200)
#define DSI_TCCR0_LPRX_TOCNT10         ((uint32_t)0x00000400)
#define DSI_TCCR0_LPRX_TOCNT11         ((uint32_t)0x00000800)
#define DSI_TCCR0_LPRX_TOCNT12         ((uint32_t)0x00001000)
#define DSI_TCCR0_LPRX_TOCNT13         ((uint32_t)0x00002000)
#define DSI_TCCR0_LPRX_TOCNT14         ((uint32_t)0x00004000)
#define DSI_TCCR0_LPRX_TOCNT15         ((uint32_t)0x00008000)

#define DSI_TCCR0_HSTX_TOCNT           ((uint32_t)0xFFFF0000)               /*!< High-Speed Transmission Timeout Counter */
#define DSI_TCCR0_HSTX_TOCNT0          ((uint32_t)0x00010000)
#define DSI_TCCR0_HSTX_TOCNT1          ((uint32_t)0x00020000)
#define DSI_TCCR0_HSTX_TOCNT2          ((uint32_t)0x00040000)
#define DSI_TCCR0_HSTX_TOCNT3          ((uint32_t)0x00080000)
#define DSI_TCCR0_HSTX_TOCNT4          ((uint32_t)0x00100000)
#define DSI_TCCR0_HSTX_TOCNT5          ((uint32_t)0x00200000)
#define DSI_TCCR0_HSTX_TOCNT6          ((uint32_t)0x00400000)
#define DSI_TCCR0_HSTX_TOCNT7          ((uint32_t)0x00800000)
#define DSI_TCCR0_HSTX_TOCNT8          ((uint32_t)0x01000000)
#define DSI_TCCR0_HSTX_TOCNT9          ((uint32_t)0x02000000)
#define DSI_TCCR0_HSTX_TOCNT10         ((uint32_t)0x04000000)
#define DSI_TCCR0_HSTX_TOCNT11         ((uint32_t)0x08000000)
#define DSI_TCCR0_HSTX_TOCNT12         ((uint32_t)0x10000000)
#define DSI_TCCR0_HSTX_TOCNT13         ((uint32_t)0x20000000)
#define DSI_TCCR0_HSTX_TOCNT14         ((uint32_t)0x40000000)
#define DSI_TCCR0_HSTX_TOCNT15         ((uint32_t)0x80000000)

/*******************  Bit definition for DSI_TCCR1 register  **************/
#define DSI_TCCR1_HSRD_TOCNT           ((uint32_t)0x0000FFFF)               /*!< High-Speed Read Timeout Counter */
#define DSI_TCCR1_HSRD_TOCNT0          ((uint32_t)0x00000001)
#define DSI_TCCR1_HSRD_TOCNT1          ((uint32_t)0x00000002)
#define DSI_TCCR1_HSRD_TOCNT2          ((uint32_t)0x00000004)
#define DSI_TCCR1_HSRD_TOCNT3          ((uint32_t)0x00000008)
#define DSI_TCCR1_HSRD_TOCNT4          ((uint32_t)0x00000010)
#define DSI_TCCR1_HSRD_TOCNT5          ((uint32_t)0x00000020)
#define DSI_TCCR1_HSRD_TOCNT6          ((uint32_t)0x00000040)
#define DSI_TCCR1_HSRD_TOCNT7          ((uint32_t)0x00000080)
#define DSI_TCCR1_HSRD_TOCNT8          ((uint32_t)0x00000100)
#define DSI_TCCR1_HSRD_TOCNT9          ((uint32_t)0x00000200)
#define DSI_TCCR1_HSRD_TOCNT10         ((uint32_t)0x00000400)
#define DSI_TCCR1_HSRD_TOCNT11         ((uint32_t)0x00000800)
#define DSI_TCCR1_HSRD_TOCNT12         ((uint32_t)0x00001000)
#define DSI_TCCR1_HSRD_TOCNT13         ((uint32_t)0x00002000)
#define DSI_TCCR1_HSRD_TOCNT14         ((uint32_t)0x00004000)
#define DSI_TCCR1_HSRD_TOCNT15         ((uint32_t)0x00008000)

/*******************  Bit definition for DSI_TCCR2 register  **************/
#define DSI_TCCR2_LPRD_TOCNT           ((uint32_t)0x0000FFFF)               /*!< Low-Power Read Timeout Counter */
#define DSI_TCCR2_LPRD_TOCNT0          ((uint32_t)0x00000001)
#define DSI_TCCR2_LPRD_TOCNT1          ((uint32_t)0x00000002)
#define DSI_TCCR2_LPRD_TOCNT2          ((uint32_t)0x00000004)
#define DSI_TCCR2_LPRD_TOCNT3          ((uint32_t)0x00000008)
#define DSI_TCCR2_LPRD_TOCNT4          ((uint32_t)0x00000010)
#define DSI_TCCR2_LPRD_TOCNT5          ((uint32_t)0x00000020)
#define DSI_TCCR2_LPRD_TOCNT6          ((uint32_t)0x00000040)
#define DSI_TCCR2_LPRD_TOCNT7          ((uint32_t)0x00000080)
#define DSI_TCCR2_LPRD_TOCNT8          ((uint32_t)0x00000100)
#define DSI_TCCR2_LPRD_TOCNT9          ((uint32_t)0x00000200)
#define DSI_TCCR2_LPRD_TOCNT10         ((uint32_t)0x00000400)
#define DSI_TCCR2_LPRD_TOCNT11         ((uint32_t)0x00000800)
#define DSI_TCCR2_LPRD_TOCNT12         ((uint32_t)0x00001000)
#define DSI_TCCR2_LPRD_TOCNT13         ((uint32_t)0x00002000)
#define DSI_TCCR2_LPRD_TOCNT14         ((uint32_t)0x00004000)
#define DSI_TCCR2_LPRD_TOCNT15         ((uint32_t)0x00008000)

