dxon/asiCanConverter/Soft/BootLoader - копия/stm32f4xx - копия.h
/*******************  Bit definition for DSI_LPMCCR register  *************/
#define DSI_LPMCCR_VLPSIZE             ((uint32_t)0x000000FF)               /*!< VACT Largest Packet Size */
#define DSI_LPMCCR_VLPSIZE0            ((uint32_t)0x00000001)
#define DSI_LPMCCR_VLPSIZE1            ((uint32_t)0x00000002)
#define DSI_LPMCCR_VLPSIZE2            ((uint32_t)0x00000004)
#define DSI_LPMCCR_VLPSIZE3            ((uint32_t)0x00000008)
#define DSI_LPMCCR_VLPSIZE4            ((uint32_t)0x00000010)
#define DSI_LPMCCR_VLPSIZE5            ((uint32_t)0x00000020)
#define DSI_LPMCCR_VLPSIZE6            ((uint32_t)0x00000040)
#define DSI_LPMCCR_VLPSIZE7            ((uint32_t)0x00000080)

#define DSI_LPMCCR_LPSIZE              ((uint32_t)0x00FF0000)               /*!< Largest Packet Size */
#define DSI_LPMCCR_LPSIZE0             ((uint32_t)0x00010000)
#define DSI_LPMCCR_LPSIZE1             ((uint32_t)0x00020000)
#define DSI_LPMCCR_LPSIZE2             ((uint32_t)0x00040000)
#define DSI_LPMCCR_LPSIZE3             ((uint32_t)0x00080000)
#define DSI_LPMCCR_LPSIZE4             ((uint32_t)0x00100000)
#define DSI_LPMCCR_LPSIZE5             ((uint32_t)0x00200000)
#define DSI_LPMCCR_LPSIZE6             ((uint32_t)0x00400000)
#define DSI_LPMCCR_LPSIZE7             ((uint32_t)0x00800000)

/*******************  Bit definition for DSI_VMCCR register  **************/
#define DSI_VMCCR_VMT                  ((uint32_t)0x00000003)               /*!< Video Mode Type */
#define DSI_VMCCR_VMT0                 ((uint32_t)0x00000001)
#define DSI_VMCCR_VMT1                 ((uint32_t)0x00000002)

#define DSI_VMCCR_LPVSAE               ((uint32_t)0x00000100)               /*!< Low-power Vertical Sync time Enable */
#define DSI_VMCCR_LPVBPE               ((uint32_t)0x00000200)               /*!< Low-power Vertical Back-porch Enable */
#define DSI_VMCCR_LPVFPE               ((uint32_t)0x00000400)               /*!< Low-power Vertical Front-porch Enable */
#define DSI_VMCCR_LPVAE                ((uint32_t)0x00000800)               /*!< Low-power Vertical Active Enable */
#define DSI_VMCCR_LPHBPE               ((uint32_t)0x00001000)               /*!< Low-power Horizontal Back-porch Enable */
#define DSI_VMCCR_LPHFE                ((uint32_t)0x00002000)               /*!< Low-power Horizontal Front-porch Enable */
#define DSI_VMCCR_FBTAAE               ((uint32_t)0x00004000)               /*!< Frame BTA Acknowledge Enable */
#define DSI_VMCCR_LPCE                 ((uint32_t)0x00008000)               /*!< Low-power Command Enable */

/*******************  Bit definition for DSI_VPCCR register  **************/
#define DSI_VPCCR_VPSIZE               ((uint32_t)0x00003FFF)               /*!< Video Packet Size */
#define DSI_VPCCR_VPSIZE0              ((uint32_t)0x00000001)
#define DSI_VPCCR_VPSIZE1              ((uint32_t)0x00000002)
#define DSI_VPCCR_VPSIZE2              ((uint32_t)0x00000004)
#define DSI_VPCCR_VPSIZE3              ((uint32_t)0x00000008)
#define DSI_VPCCR_VPSIZE4              ((uint32_t)0x00000010)
#define DSI_VPCCR_VPSIZE5              ((uint32_t)0x00000020)
#define DSI_VPCCR_VPSIZE6              ((uint32_t)0x00000040)
#define DSI_VPCCR_VPSIZE7              ((uint32_t)0x00000080)
#define DSI_VPCCR_VPSIZE8              ((uint32_t)0x00000100)
#define DSI_VPCCR_VPSIZE9              ((uint32_t)0x00000200)
#define DSI_VPCCR_VPSIZE10             ((uint32_t)0x00000400)
#define DSI_VPCCR_VPSIZE11             ((uint32_t)0x00000800)
#define DSI_VPCCR_VPSIZE12             ((uint32_t)0x00001000)
#define DSI_VPCCR_VPSIZE13             ((uint32_t)0x00002000)

/*******************  Bit definition for DSI_VCCCR register  **************/
#define DSI_VCCCR_NUMC                 ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSI_VCCCR_NUMC0                ((uint32_t)0x00000001)
#define DSI_VCCCR_NUMC1                ((uint32_t)0x00000002)
#define DSI_VCCCR_NUMC2                ((uint32_t)0x00000004)
#define DSI_VCCCR_NUMC3                ((uint32_t)0x00000008)
#define DSI_VCCCR_NUMC4                ((uint32_t)0x00000010)
#define DSI_VCCCR_NUMC5                ((uint32_t)0x00000020)
#define DSI_VCCCR_NUMC6                ((uint32_t)0x00000040)
#define DSI_VCCCR_NUMC7                ((uint32_t)0x00000080)
#define DSI_VCCCR_NUMC8                ((uint32_t)0x00000100)
#define DSI_VCCCR_NUMC9                ((uint32_t)0x00000200)
#define DSI_VCCCR_NUMC10               ((uint32_t)0x00000400)
#define DSI_VCCCR_NUMC11               ((uint32_t)0x00000800)
#define DSI_VCCCR_NUMC12               ((uint32_t)0x00001000)

/*******************  Bit definition for DSI_VNPCCR register  *************/
#define DSI_VNPCCR_NPSIZE              ((uint32_t)0x00001FFF)               /*!< Number of Chunks */
#define DSI_VNPCCR_NPSIZE0             ((uint32_t)0x00000001)
#define DSI_VNPCCR_NPSIZE1             ((uint32_t)0x00000002)
#define DSI_VNPCCR_NPSIZE2             ((uint32_t)0x00000004)
#define DSI_VNPCCR_NPSIZE3             ((uint32_t)0x00000008)
#define DSI_VNPCCR_NPSIZE4             ((uint32_t)0x00000010)
#define DSI_VNPCCR_NPSIZE5             ((uint32_t)0x00000020)
#define DSI_VNPCCR_NPSIZE6             ((uint32_t)0x00000040)
#define DSI_VNPCCR_NPSIZE7             ((uint32_t)0x00000080)
#define DSI_VNPCCR_NPSIZE8             ((uint32_t)0x00000100)
#define DSI_VNPCCR_NPSIZE9             ((uint32_t)0x00000200)
#define DSI_VNPCCR_NPSIZE10            ((uint32_t)0x00000400)
#define DSI_VNPCCR_NPSIZE11            ((uint32_t)0x00000800)
#define DSI_VNPCCR_NPSIZE12            ((uint32_t)0x00001000)

/*******************  Bit definition for DSI_VHSACCR register  ************/
#define DSI_VHSACCR_HSA                ((uint32_t)0x00000FFF)               /*!< Horizontal Synchronism Active duration */
#define DSI_VHSACCR_HSA0               ((uint32_t)0x00000001)
#define DSI_VHSACCR_HSA1               ((uint32_t)0x00000002)
#define DSI_VHSACCR_HSA2               ((uint32_t)0x00000004)
#define DSI_VHSACCR_HSA3               ((uint32_t)0x00000008)
#define DSI_VHSACCR_HSA4               ((uint32_t)0x00000010)
#define DSI_VHSACCR_HSA5               ((uint32_t)0x00000020)
#define DSI_VHSACCR_HSA6               ((uint32_t)0x00000040)
#define DSI_VHSACCR_HSA7               ((uint32_t)0x00000080)
#define DSI_VHSACCR_HSA8               ((uint32_t)0x00000100)
#define DSI_VHSACCR_HSA9               ((uint32_t)0x00000200)
#define DSI_VHSACCR_HSA10              ((uint32_t)0x00000400)
#define DSI_VHSACCR_HSA11              ((uint32_t)0x00000800)

/*******************  Bit definition for DSI_VHBPCCR register  ************/
#define DSI_VHBPCCR_HBP                ((uint32_t)0x00000FFF)               /*!< Horizontal Back-Porch duration */
#define DSI_VHBPCCR_HBP0               ((uint32_t)0x00000001)
#define DSI_VHBPCCR_HBP1               ((uint32_t)0x00000002)
#define DSI_VHBPCCR_HBP2               ((uint32_t)0x00000004)
#define DSI_VHBPCCR_HBP3               ((uint32_t)0x00000008)
#define DSI_VHBPCCR_HBP4               ((uint32_t)0x00000010)
#define DSI_VHBPCCR_HBP5               ((uint32_t)0x00000020)
#define DSI_VHBPCCR_HBP6               ((uint32_t)0x00000040)
#define DSI_VHBPCCR_HBP7               ((uint32_t)0x00000080)
#define DSI_VHBPCCR_HBP8               ((uint32_t)0x00000100)
#define DSI_VHBPCCR_HBP9               ((uint32_t)0x00000200)
#define DSI_VHBPCCR_HBP10              ((uint32_t)0x00000400)
#define DSI_VHBPCCR_HBP11              ((uint32_t)0x00000800)

