dxon/asiCanConverter/Soft/BootLoader - копия/stm32f4xx - копия.h
#define DSI_WPCR2_THSPREP                ((uint32_t)0x00FF0000)              /*!< t-HSPREP */
#define DSI_WPCR2_THSPREP0               ((uint32_t)0x00010000)
#define DSI_WPCR2_THSPREP1               ((uint32_t)0x00020000)
#define DSI_WPCR2_THSPREP2               ((uint32_t)0x00040000)
#define DSI_WPCR2_THSPREP3               ((uint32_t)0x00080000)
#define DSI_WPCR2_THSPREP4               ((uint32_t)0x00100000)
#define DSI_WPCR2_THSPREP5               ((uint32_t)0x00200000)
#define DSI_WPCR2_THSPREP6               ((uint32_t)0x00400000)
#define DSI_WPCR2_THSPREP7               ((uint32_t)0x00800000)

#define DSI_WPCR2_THSTRAIL               ((uint32_t)0xFF000000)              /*!< t-HSTRAIL */
#define DSI_WPCR2_THSTRAIL0              ((uint32_t)0x01000000)
#define DSI_WPCR2_THSTRAIL1              ((uint32_t)0x02000000)
#define DSI_WPCR2_THSTRAIL2              ((uint32_t)0x04000000)
#define DSI_WPCR2_THSTRAIL3              ((uint32_t)0x08000000)
#define DSI_WPCR2_THSTRAIL4              ((uint32_t)0x10000000)
#define DSI_WPCR2_THSTRAIL5              ((uint32_t)0x20000000)
#define DSI_WPCR2_THSTRAIL6              ((uint32_t)0x40000000)
#define DSI_WPCR2_THSTRAIL7              ((uint32_t)0x80000000)

/*******************  Bit definition for DSI_WPCR3 register  ***************/
#define DSI_WPCR3_THSZERO                ((uint32_t)0x000000FF)              /*!< t-HSZERO */
#define DSI_WPCR3_THSZERO0               ((uint32_t)0x00000001)
#define DSI_WPCR3_THSZERO1               ((uint32_t)0x00000002)
#define DSI_WPCR3_THSZERO2               ((uint32_t)0x00000004)
#define DSI_WPCR3_THSZERO3               ((uint32_t)0x00000008)
#define DSI_WPCR3_THSZERO4               ((uint32_t)0x00000010)
#define DSI_WPCR3_THSZERO5               ((uint32_t)0x00000020)
#define DSI_WPCR3_THSZERO6               ((uint32_t)0x00000040)
#define DSI_WPCR3_THSZERO7               ((uint32_t)0x00000080)

#define DSI_WPCR3_TLPXD                  ((uint32_t)0x0000FF00)              /*!< t-LPXD */
#define DSI_WPCR3_TLPXD0                 ((uint32_t)0x00000100)
#define DSI_WPCR3_TLPXD1                 ((uint32_t)0x00000200)
#define DSI_WPCR3_TLPXD2                 ((uint32_t)0x00000400)
#define DSI_WPCR3_TLPXD3                 ((uint32_t)0x00000800)
#define DSI_WPCR3_TLPXD4                 ((uint32_t)0x00001000)
#define DSI_WPCR3_TLPXD5                 ((uint32_t)0x00002000)
#define DSI_WPCR3_TLPXD6                 ((uint32_t)0x00004000)
#define DSI_WPCR3_TLPXD7                 ((uint32_t)0x00008000)

#define DSI_WPCR3_THSEXIT                ((uint32_t)0x00FF0000)              /*!< t-HSEXIT */
#define DSI_WPCR3_THSEXIT0               ((uint32_t)0x00010000)
#define DSI_WPCR3_THSEXIT1               ((uint32_t)0x00020000)
#define DSI_WPCR3_THSEXIT2               ((uint32_t)0x00040000)
#define DSI_WPCR3_THSEXIT3               ((uint32_t)0x00080000)
#define DSI_WPCR3_THSEXIT4               ((uint32_t)0x00100000)
#define DSI_WPCR3_THSEXIT5               ((uint32_t)0x00200000)
#define DSI_WPCR3_THSEXIT6               ((uint32_t)0x00400000)
#define DSI_WPCR3_THSEXIT7               ((uint32_t)0x00800000)

#define DSI_WPCR3_TLPXC                  ((uint32_t)0xFF000000)              /*!< t-LPXC */
#define DSI_WPCR3_TLPXC0                 ((uint32_t)0x01000000)
#define DSI_WPCR3_TLPXC1                 ((uint32_t)0x02000000)
#define DSI_WPCR3_TLPXC2                 ((uint32_t)0x04000000)
#define DSI_WPCR3_TLPXC3                 ((uint32_t)0x08000000)
#define DSI_WPCR3_TLPXC4                 ((uint32_t)0x10000000)
#define DSI_WPCR3_TLPXC5                 ((uint32_t)0x20000000)
#define DSI_WPCR3_TLPXC6                 ((uint32_t)0x40000000)
#define DSI_WPCR3_TLPXC7                 ((uint32_t)0x80000000)

/*******************  Bit definition for DSI_WPCR4 register  ***************/
#define DSI_WPCR4_TCLKPOST               ((uint32_t)0x000000FF)              /*!< t-CLKPOST */
#define DSI_WPCR4_TCLKPOST0              ((uint32_t)0x00000001)
#define DSI_WPCR4_TCLKPOST1              ((uint32_t)0x00000002)
#define DSI_WPCR4_TCLKPOST2              ((uint32_t)0x00000004)
#define DSI_WPCR4_TCLKPOST3              ((uint32_t)0x00000008)
#define DSI_WPCR4_TCLKPOST4              ((uint32_t)0x00000010)
#define DSI_WPCR4_TCLKPOST5              ((uint32_t)0x00000020)
#define DSI_WPCR4_TCLKPOST6              ((uint32_t)0x00000040)
#define DSI_WPCR4_TCLKPOST7              ((uint32_t)0x00000080)

/*******************  Bit definition for DSI_WRPCR register  ***************/
#define DSI_WRPCR_PLLEN                  ((uint32_t)0x00000001)              /*!< PLL Enable */
#define DSI_WRPCR_PLL_NDIV               ((uint32_t)0x000001FC)              /*!< PLL Loop Division Factor */
#define DSI_WRPCR_PLL_NDIV0              ((uint32_t)0x00000004)
#define DSI_WRPCR_PLL_NDIV1              ((uint32_t)0x00000008)
#define DSI_WRPCR_PLL_NDIV2              ((uint32_t)0x00000010)
#define DSI_WRPCR_PLL_NDIV3              ((uint32_t)0x00000020)
#define DSI_WRPCR_PLL_NDIV4              ((uint32_t)0x00000040)
#define DSI_WRPCR_PLL_NDIV5              ((uint32_t)0x00000080)
#define DSI_WRPCR_PLL_NDIV6              ((uint32_t)0x00000100)

#define DSI_WRPCR_PLL_IDF                ((uint32_t)0x00007800)              /*!< PLL Input Division Factor */
#define DSI_WRPCR_PLL_IDF0               ((uint32_t)0x00000800)
#define DSI_WRPCR_PLL_IDF1               ((uint32_t)0x00001000)
#define DSI_WRPCR_PLL_IDF2               ((uint32_t)0x00002000)
#define DSI_WRPCR_PLL_IDF3               ((uint32_t)0x00004000)

#define DSI_WRPCR_PLL_ODF                ((uint32_t)0x00030000)              /*!< PLL Output Division Factor */
#define DSI_WRPCR_PLL_ODF0               ((uint32_t)0x00010000)
#define DSI_WRPCR_PLL_ODF1               ((uint32_t)0x00020000)

#define DSI_WRPCR_REGEN                  ((uint32_t)0x01000000)              /*!< Regulator Enable */
#endif /* STM32F469_479xx */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PWR_CR register  ********************/
#define  PWR_CR_LPDS                         ((uint32_t)0x00000001)     /*!< Low-Power Deepsleep                 */
#define  PWR_CR_PDDS                         ((uint32_t)0x00000002)     /*!< Power Down Deepsleep                */
#define  PWR_CR_CWUF                         ((uint32_t)0x00000004)     /*!< Clear Wakeup Flag                   */
#define  PWR_CR_CSBF                         ((uint32_t)0x00000008)     /*!< Clear Standby Flag                  */
#define  PWR_CR_PVDE                         ((uint32_t)0x00000010)     /*!< Power Voltage Detector Enable       */

#define  PWR_CR_PLS                          ((uint32_t)0x000000E0)     /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CR_PLS_0                        ((uint32_t)0x00000020)     /*!< Bit 0 */
#define  PWR_CR_PLS_1                        ((uint32_t)0x00000040)     /*!< Bit 1 */
#define  PWR_CR_PLS_2                        ((uint32_t)0x00000080)     /*!< Bit 2 */

/*!< PVD level configuration */
#define  PWR_CR_PLS_LEV0                     ((uint32_t)0x00000000)     /*!< PVD level 0 */
#define  PWR_CR_PLS_LEV1                     ((uint32_t)0x00000020)     /*!< PVD level 1 */
#define  PWR_CR_PLS_LEV2                     ((uint32_t)0x00000040)     /*!< PVD level 2 */
#define  PWR_CR_PLS_LEV3                     ((uint32_t)0x00000060)     /*!< PVD level 3 */
#define  PWR_CR_PLS_LEV4                     ((uint32_t)0x00000080)     /*!< PVD level 4 */
#define  PWR_CR_PLS_LEV5                     ((uint32_t)0x000000A0)     /*!< PVD level 5 */
#define  PWR_CR_PLS_LEV6                     ((uint32_t)0x000000C0)     /*!< PVD level 6 */
#define  PWR_CR_PLS_LEV7                     ((uint32_t)0x000000E0)     /*!< PVD level 7 */

#define  PWR_CR_DBP                          ((uint32_t)0x00000100)     /*!< Disable Backup Domain write protection                     */
#define  PWR_CR_FPDS                         ((uint32_t)0x00000200)     /*!< Flash power down in Stop mode                              */
#define  PWR_CR_LPUDS                        ((uint32_t)0x00000400)     /*!< Low-Power Regulator in Stop under-drive mode               */
#define  PWR_CR_MRUDS                        ((uint32_t)0x00000800)     /*!< Main regulator in Stop under-drive mode                    */

